OpenFOAM_Case/injectorNozzle-OF11/0.orig/alpha.ammonia.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           volScalarField;
    location        "0";
    object          alpha.ammonia;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           $internalField;
    }
    "injectorWall.*"
    {
        type            zeroGradient;
        value           $internalField;
    }
    "(front|back)"
    {
        type            wedge;
        value           $internalField;
    }
    
    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
