OpenFOAM_Case/injectorNozzle-OF11/constant/phaseChangeProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      phaseChangeProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phaseChangeModel SchnerrSauer;

pSat            1.1e7;//2364;

SchnerrSauerCoeffs
{
    n               1e14;//1.6E+13;
    dNuc            2e-6;//2.0E-06;
    Cc              1.0;
    Cv              1.0;
}


// ************************************************************************* //
