OpenFOAM_Case/injectorNozzle-OF11/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

patches
(
    {
        // Name of new patch
        name    front;

        // Dictionary to construct new patch from
        patchInfo
        {
            type    wedge;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom patches;

        // If constructFrom = patches : names of patches. Wildcards allowed.
        patches (frontBM);
    }
    {
        name    back;
        patchInfo
        {
            type    wedge;
        }
        constructFrom patches;
        patches (backBM);
    }
    {
        name    inlet;
        patchInfo
        {
            type    patch;
        }
        constructFrom patches;
        patches (inletBM);
    }
    {
        name    outlet;
        patchInfo
        {
            type    patch;
        }
        constructFrom patches;
        patches (outletBM);
    }
    {
        name    symmetry;
        patchInfo
        {
            type    symmetry;
        }
        constructFrom patches;
        patches (symmetryBM);
    }
    {
        name    injectorWall;
        patchInfo
        {
            type    wall;
        }
        constructFrom patches;
        patches (injectorWallBM);
    }
);

// ************************************************************************* //
